[
    {
        "Title": "Spy Kids 4: All the Time in the World",
        "Year": "2011",
        "Rated": "PG",
        "Released": "19 Aug 2011",
        "Runtime": "89 min",
        "Genre": "Action, Adventure, Comedy",
        "Director": "Robert Rodriguez",
        "Writer": "Robert Rodriguez",
        "Actors": "Jessica Alba, Jeremy Piven, Joel McHale",
        "Plot": "A retired spy is called back into action, and to bond with her new step-children, she invites them along for the adventure to stop the evil Timekeeper from taking over the world.",
        "Language": "English",
        "Country": "United States",
        "Awards": "6 nominations",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMjE1NTEwNzM5MV5BMl5BanBnXkFtZTcwNTA5Njc0NQ@@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "3.5/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "23%"
            },
            {
                "Source": "Metacritic",
                "Value": "37/100"
            }
        ],
        "Metascore": "37",
        "imdbRating": "3.5",
        "imdbVotes": "28,296",
        "imdbID": "tt1517489",
        "Type": "movie",
        "DVD": "19 Aug 2013",
        "BoxOffice": "$38,538,188",
        "Production": "N/A",
        "Website": "N/A",
        "Response": "True"
    },
    {
        "Title": "All About My Mother",
        "Year": "1999",
        "Rated": "R",
        "Released": "31 Mar 2000",
        "Runtime": "101 min",
        "Genre": "Comedy, Drama, Romance",
        "Director": "Pedro Almodóvar",
        "Writer": "Pedro Almodóvar",
        "Actors": "Cecilia Roth, Marisa Paredes, Candela Peña",
        "Plot": "Argentine Manuela Echevarria, an organ transplant coordinator at a Madrid hospital, ran off from her husband in Barcelona eighteen years ago upon learning that she was pregnant, their son, Esteban, who she has never told about his father despite his curiosity, and her husband who didn't know about the pregnancy when she ran off. An event coinciding with Esteban, an aspiring writer, turning seventeen leads to Manuela feeling the need to return to Barcelona to look for her husband. There, she ends up further acting as the maternal figure for people in need. One is a young nun named Sister Rosa, who she meets through her old friend, a transvestite prostitute who has assumed the name Agrado in her agreeable nature. Rosa has a strained relationship with her own conservative mother, as she is consumed with caring for her ill husband, who suffers from Alzheimer's. The other is actress Huma Rojo, currently appearing as Blanche Dubois in a stage production of A Streetcar Named Desire, which has long been a touchstone for Manuela in productions of it coinciding with milestone moments in her life, this production no different. Huma is in a troubled codependent relationship with her younger \"Stella Kowalski\" costar Nina Cruz, a closet junkie, hence Huma's emotional need for support. By the end of her stay in Barcelona, Manuela will have another non-relative for who she will feel the need to act as a mother figure.",
        "Language": "Spanish, Catalan",
        "Country": "Spain, France",
        "Awards": "Won 1 Oscar. 59 wins & 40 nominations total",
        "Poster": "https://m.media-amazon.com/images/M/MV5BZmIwZTYyMTUtZGE0Mi00NWIwLTljMmEtNjA2OTg0NDczYTM1XkEyXkFqcGdeQXVyMTcwOTQzOTYy._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "7.8/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "98%"
            },
            {
                "Source": "Metacritic",
                "Value": "87/100"
            }
        ],
        "Metascore": "87",
        "imdbRating": "7.8",
        "imdbVotes": "102,373",
        "imdbID": "tt0185125",
        "Type": "movie",
        "DVD": "01 Jan 2014",
        "BoxOffice": "$8,344,738",
        "Production": "N/A",
        "Website": "N/A",
        "Response": "True"
    },
    {
        "Title": "Jingle All the Way",
        "Year": "1996",
        "Rated": "PG",
        "Released": "22 Nov 1996",
        "Runtime": "89 min",
        "Genre": "Adventure, Comedy, Family",
        "Director": "Brian Levant",
        "Writer": "Randy Kornfield",
        "Actors": "Arnold Schwarzenegger, Sinbad, Phil Hartman",
        "Plot": "Howard Langston, a salesman for a mattress company, is constantly busy at his job, and he also constantly disappoints his son, Jamie. After he misses his son's karate exposition, he tries hard to come up with a way to make it up to him. Jamie says he all he wants for Christmas is an action figure of television hero Turbo Man. Unfortunately for Howard, it is Christmas Eve, and every store is sold out of Turbo Man figures; now Howard must travel all over town and compete with everybody else including a mail man named Myron to find a Turbo Man action figure, and to make it to the Wintertainment Parade, which will feature Turbo Man.",
        "Language": "English",
        "Country": "United States",
        "Awards": "2 wins & 4 nominations",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMmJlYzViNzctMjQ1Ni00ZWQ4LThkN2YtMzI2ZGU5Nzk0NTAyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "5.7/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "20%"
            },
            {
                "Source": "Metacritic",
                "Value": "34/100"
            }
        ],
        "Metascore": "34",
        "imdbRating": "5.7",
        "imdbVotes": "115,889",
        "imdbID": "tt0116705",
        "Type": "movie",
        "DVD": "01 Mar 2013",
        "BoxOffice": "$60,592,389",
        "Production": "N/A",
        "Website": "N/A",
        "Response": "True"
    },
    {
        "Title": "All About Steve",
        "Year": "2009",
        "Rated": "PG-13",
        "Released": "04 Sep 2009",
        "Runtime": "99 min",
        "Genre": "Comedy, Family, Romance",
        "Director": "Phil Traill",
        "Writer": "Kim Barker",
        "Actors": "Sandra Bullock, Bradley Cooper, Thomas Haden Church",
        "Plot": "Mary Horowitz writes crossword puzzles for the Sacramento Herald. She's loquacious to a fault. When kids at a Career Day make fun of her for being single, she accepts a blind date with Steve, the cameraman for a CNN-like news network. Within minutes she decides he's the man for her. Quickly put off by her constant verbiage and over-the-top advances, he makes an off-hand remark about going on the road with her, then splits. Moonstruck, she writes a sappy crossword puzzle, loses her job, and decides to follow him as the news team crisscrosses the Southwest; Steve's team eggs her on. Then she falls into a mine shaft, and she and Steve become a story. It a love story?",
        "Language": "English, Spanish, French, American Sign ",
        "Country": "United States",
        "Awards": "2 wins & 3 nominations",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMTA5MTQxOTE2OTReQTJeQWpwZ15BbWU3MDY5NzI4NzI@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "4.8/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "6%"
            },
            {
                "Source": "Metacritic",
                "Value": "17/100"
            }
        ],
        "Metascore": "17",
        "imdbRating": "4.8",
        "imdbVotes": "44,362",
        "imdbID": "tt0881891",
        "Type": "movie",
        "DVD": "01 Mar 2013",
        "BoxOffice": "$33,862,903",
        "Production": "N/A",
        "Website": "N/A",
        "Response": "True"
    },
    {
        "Title": "The Kids Are All Right",
        "Year": "2010",
        "Rated": "R",
        "Released": "30 Jul 2010",
        "Runtime": "106 min",
        "Genre": "Comedy, Drama, Romance",
        "Director": "Lisa Cholodenko",
        "Writer": "Lisa Cholodenko, Stuart Blumberg",
        "Actors": "Annette Bening, Julianne Moore, Mark Ruffalo",
        "Plot": "Nic and Jules are in a long term, committed, loving but by no means perfect same-sex relationship. Nic, a physician, needs to wield what she believes is control, whereas Jules, under that control, is less self-assured. During their relationship, Jules has floundered in her \"nine to five\" life, sometimes trying to start a business - always unsuccessfully - or being the stay-at-home mom. She is currently trying to start a landscape design business. They have two teen-aged children, Joni (conceived by Nic) and Laser (by Jules). Although not exact replicas, each offspring does more closely resemble his/her biological mother in temperament. Joni and Laser are also half-siblings, having the same unknown sperm donor father. Shortly after Joni's eighteenth birthday and shortly before she plans to leave the house and head off to college, Laser, only fifteen and underage to do so, pleads with her to try and contact their sperm donor father. Somewhat reluctantly, she does. He is late thirty-something Paul, a co-op farmer and restaurateur. Despite his seemingly successful businesses, Paul has always shirked responsibility, most specifically in his personal life. After Joni and Laser meet with Paul, Nic and Jules learn what their children have done and, although they don't want Paul infiltrating their lives, want to meet him - especially as Joni and Laser seem to want to maintain some sort of relationship with him. As Paul's relationship with the entire family grows (which includes his hiring Jules to design and construct his backyard), they have an effect on what he wants in life. In turn, he affects their family dynamic as well as each person's relationships outside of it.",
        "Language": "English",
        "Country": "United States, France",
        "Awards": "Nominated for 4 Oscars. 29 wins & 133 nominations total",
        "Poster": "https://m.media-amazon.com/images/M/MV5BMjE4NTMwNDg5MF5BMl5BanBnXkFtZTcwNDY2ODE0Mw@@._V1_SX300.jpg",
        "Ratings": [
            {
                "Source": "Internet Movie Database",
                "Value": "7.0/10"
            },
            {
                "Source": "Rotten Tomatoes",
                "Value": "92%"
            },
            {
                "Source": "Metacritic",
                "Value": "86/100"
            }
        ],
        "Metascore": "86",
        "imdbRating": "7.0",
        "imdbVotes": "134,262",
        "imdbID": "tt0842926",
        "Type": "movie",
        "DVD": "01 Dec 2015",
        "BoxOffice": "$20,811,365",
        "Production": "N/A",
        "Website": "N/A",
        "Response": "True"
    }
]